import { Lecturer } from "../types";


export const lecturersList = [
  {
    name: "Мащенко С.О.",
    subjects: ["Теорія прийняття рішень", "Статистичне моделювання"],
    types: ["Лекція", "Практика"],
  },
  {
    name: "Пашко А.О.",
    subjects: ["Статистичне моделювання", "Інтелектуальні системи"],
    types: ["Лекція", "Практика"],
  },
  {
    name: "Тарануха В.Ю.",
    subjects: ["Інтелектуальні системи", "Інформаційні технології"],
    types: ["Лекція", "Практика"],
  },
  {
    name: "Шишацька О.В.",
    subjects: ["Теорія прийняття рішень"],
    types: ["Лекція", "Практика"],
  },
  {
    name: "Ткаченко О.М.",
    subjects: ["Інформаційні технології", "Розробка ПЗ під мобільні"],
    types: ["Лекція", "Практика"],
  },
  {
    name: "Криволап А.В.",
    subjects: ["Розробка ПЗ під мобільні", "Інформаційні технології"],
    types: ["Лекція", "Практика"],
  },
  {
    name: "Свистунов А.О.",
    subjects: ["Розробка ПЗ під мобільні", "Інформаційні технології"],
    types: ["Лекція", "Практика"],
  },
  {
    name: "Зінько Т.П.",
    subjects: ["Теорія прийняття рішень", "Статистичне моделювання"],
    types: ["Лекція", "Практика"],
  },
];

export const generateLecturers = (): Lecturer[] => {
  return lecturersList;
};
